In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={'names':['ramesh','suresh',np.nan,'mahesh'],
      'age':[31,32,33,np.nan],
      'city':[np.nan,'hyd','mumbai','chrnnai']}

In [3]:
data1=pd.DataFrame(dict1)

In [7]:
data1.isnull()

   names    age   city
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [5]:
data1.isnull().sum()/len(data1)

names    0.25
age      0.25
city     0.25
dtype: float64

In [6]:
data1.isnull().sum()*100/len(data1)

names    25.0
age      25.0
city     25.0
dtype: float64

In [8]:
dict2={'names':['ramesh','suresh',None,'mahesh'],
      'age':[31,32,33,None],
      'city':[None,'hyd','mumbai','chrnnai']}
data2=pd.DataFrame(dict2)
data2

    names   age     city
0  ramesh  31.0     None
1  suresh  32.0      hyd
2    None  33.0   mumbai
3  mahesh   NaN  chrnnai

In [13]:
dict21={'names':['ramesh','suresh',None,'mahesh'],
      'age':[31,32,33,np.nan],
      'city':[Nan,'hyd','mumbai','chrnnai']}
data21=pd.DataFrame(dict21)
data21

NameError: name 'Nan' is not defined

In [9]:
data2.isnull()

   names    age   city
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [12]:
data2.isnull()

   names    age   city
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [11]:
dict3={'names':['ramesh','suresh','null','mahesh'],
      'age':[31,32,33,'null'],
      'city':['null','hyd','mumbai','chrnnai']}
data3=pd.DataFrame(dict3)
data3

    names   age     city
0  ramesh    31     null
1  suresh    32      hyd
2    null    33   mumbai
3  mahesh  null  chrnnai

**method-1**
fill the missing values with random number
dataframe name=data1
method name:fillna

In [14]:
data1.fillna(40)

    names   age     city
0  ramesh  31.0       40
1  suresh  32.0      hyd
2      40  33.0   mumbai
3  mahesh  40.0  chrnnai

In [ ]:
method-2
fill the missing value with random number on specific column
method name- fillna

In [15]:
data1['names'].fillna('sathish')

0     ramesh
1     suresh
2    sathish
3     mahesh
Name: names, dtype: object

In [16]:
data1['names'].fillna('sathish',inplace=True)
data1

     names   age     city
0   ramesh  31.0      NaN
1   suresh  32.0      hyd
2  sathish  33.0   mumbai
3   mahesh   NaN  chrnnai

In [17]:
dict1={'names':['ramesh','suresh',np.nan,'mahesh'],
      'age':[31,32,33,np.nan],
      'city':[np.nan,'hyd','mumbai','chrnnai']}
data1=pd.DataFrame(dict1)

In [ ]:
method-3
-bfill
-ffill
-pad
-backfill

In [18]:
data1.fillna(method='backfill')
#names index 2 is missed value
# it will replace by index 3 value
# age index3 is missed value
# we dont have index 4, so the value is NaN
# city index 0 has missed value 
# it replace with index 1

    names   age     city
0  ramesh  31.0      hyd
1  suresh  32.0      hyd
2  mahesh  33.0   mumbai
3  mahesh   NaN  chrnnai

In [19]:
data1

    names   age     city
0  ramesh  31.0      NaN
1  suresh  32.0      hyd
2     NaN  33.0   mumbai
3  mahesh   NaN  chrnnai

In [20]:
data1.fillna(method='ffill')

    names   age     city
0  ramesh  31.0      NaN
1  suresh  32.0      hyd
2  suresh  33.0   mumbai
3  mahesh  33.0  chrnnai

In [ ]:
-BFILL AND BACKFILL BOTH ARE SAME 
-PAD

-mean 
-median 
-mode

In [22]:
data1

    names   age     city
0  ramesh  31.0      NaN
1  suresh  32.0      hyd
2     NaN  33.0   mumbai
3  mahesh   NaN  chrnnai

In [23]:
age_mean=data1['age'].mean()
age_mean

32.0

In [24]:
data1['age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: age, dtype: float64

In [ ]:
#instead of providing random number 
# we are filling with mean of the data

In [26]:
age_median=data1['age'].median()
age_median

32.0

In [27]:
data1['age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: age, dtype: float64

In [ ]:
#leval1: mean median mode
#leval2: bfill fill
#leval3:

KNN IMPUTER

In [ ]:
KNN: k nearest neighbours
    
-in the knn imputer instead of taking mean of all the values
-will choose neighbours data 
-will take those mean only

In [ ]:
ss , sklearn.pre

KNN imputer

In [39]:
n_neghbors is a parameter can choose by user
if we dont choose by default 
KNN.fit_transform(data1[['age']])

SyntaxError: invalid syntax (1623924938.py, line 1)

In [40]:
from sklearn.impute import KNNImputer
Knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

NameError: name 'knn' is not defined

In [ ]:
METHOD-6
BASED ON OTHER COLUMNS
SOME TIME ALL OTHER METHODS WILL NOT PROVIDE GOOD JUSTIFICATION 
AT THAT TIME WE NEED TO CHECK OTHER COLUMNS DEPENDENCY ALSO
MOST OF THE TIME WILL PICK A COLUMN WHICH HAVE HIGHEST COREELATION

In [ ]:
data transformation techniques